backend: tensorflow
class_name: Model
config:
  input_layers:
  - [Main_Input, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 416, 416, 3]
      dtype: float32
      name: Main_Input
      sparse: false
    inbound_nodes: []
    name: Main_Input
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_1_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Main_Input
        - 0
        - 0
        - {}
    name: Layer_1_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_1_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_1_CONV
        - 0
        - 0
        - {}
    name: Layer_1_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_1_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_1_Batch
        - 0
        - 0
        - {}
    name: Layer_1_LRELU
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: Layer_2_Zero_Padding
      padding: !!python/tuple
      - !!python/tuple [1, 0]
      - !!python/tuple [1, 0]
      trainable: true
    inbound_nodes:
    - - - Layer_1_LRELU
        - 0
        - 0
        - {}
    name: Layer_2_Zero_Padding
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_2_CONV
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_2_Zero_Padding
        - 0
        - 0
        - {}
    name: Layer_2_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_2_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_2_CONV
        - 0
        - 0
        - {}
    name: Layer_2_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_2_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_2_Batch
        - 0
        - 0
        - {}
    name: Layer_2_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_3_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_2_LRELU
        - 0
        - 0
        - {}
    name: Layer_3_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_3_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_3_CONV
        - 0
        - 0
        - {}
    name: Layer_3_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_3_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_3_Batch
        - 0
        - 0
        - {}
    name: Layer_3_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_4_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_3_LRELU
        - 0
        - 0
        - {}
    name: Layer_4_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_4_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_4_CONV
        - 0
        - 0
        - {}
    name: Layer_4_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_4_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_4_Batch
        - 0
        - 0
        - {}
    name: Layer_4_LRELU
  - class_name: Add
    config: {name: Layer_5_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_2_LRELU
        - 0
        - 0
        - &id002 {}
      - - Layer_4_LRELU
        - 0
        - 0
        - *id002
    name: Layer_5_Shortcut_Add
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: Layer_6_Zero_Padding
      padding: !!python/tuple
      - !!python/tuple [1, 0]
      - !!python/tuple [1, 0]
      trainable: true
    inbound_nodes:
    - - - Layer_5_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_6_Zero_Padding
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_6_CONV
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_6_Zero_Padding
        - 0
        - 0
        - {}
    name: Layer_6_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_6_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_6_CONV
        - 0
        - 0
        - {}
    name: Layer_6_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_6_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_6_Batch
        - 0
        - 0
        - {}
    name: Layer_6_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_7_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_6_LRELU
        - 0
        - 0
        - {}
    name: Layer_7_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_7_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_7_CONV
        - 0
        - 0
        - {}
    name: Layer_7_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_7_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_7_Batch
        - 0
        - 0
        - {}
    name: Layer_7_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_8_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_7_LRELU
        - 0
        - 0
        - {}
    name: Layer_8_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_8_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_8_CONV
        - 0
        - 0
        - {}
    name: Layer_8_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_8_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_8_Batch
        - 0
        - 0
        - {}
    name: Layer_8_LRELU
  - class_name: Add
    config: {name: Layer_9_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_6_LRELU
        - 0
        - 0
        - &id003 {}
      - - Layer_8_LRELU
        - 0
        - 0
        - *id003
    name: Layer_9_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_10_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_9_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_10_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_10_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_10_CONV
        - 0
        - 0
        - {}
    name: Layer_10_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_10_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_10_Batch
        - 0
        - 0
        - {}
    name: Layer_10_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_11_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_10_LRELU
        - 0
        - 0
        - {}
    name: Layer_11_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_11_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_11_CONV
        - 0
        - 0
        - {}
    name: Layer_11_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_11_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_11_Batch
        - 0
        - 0
        - {}
    name: Layer_11_LRELU
  - class_name: Add
    config: {name: Layer_12_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_9_Shortcut_Add
        - 0
        - 0
        - &id004 {}
      - - Layer_11_LRELU
        - 0
        - 0
        - *id004
    name: Layer_12_Shortcut_Add
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: Layer_13_Zero_Padding
      padding: !!python/tuple
      - !!python/tuple [1, 0]
      - !!python/tuple [1, 0]
      trainable: true
    inbound_nodes:
    - - - Layer_12_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_13_Zero_Padding
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_13_CONV
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_13_Zero_Padding
        - 0
        - 0
        - {}
    name: Layer_13_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_12_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_13_CONV
        - 0
        - 0
        - {}
    name: Layer_12_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_13_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_12_Batch
        - 0
        - 0
        - {}
    name: Layer_13_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_14_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_13_LRELU
        - 0
        - 0
        - {}
    name: Layer_14_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_14_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_14_CONV
        - 0
        - 0
        - {}
    name: Layer_14_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_14_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_14_Batch
        - 0
        - 0
        - {}
    name: Layer_14_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_15_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_14_LRELU
        - 0
        - 0
        - {}
    name: Layer_15_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_15_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_15_CONV
        - 0
        - 0
        - {}
    name: Layer_15_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_15_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_15_Batch
        - 0
        - 0
        - {}
    name: Layer_15_LRELU
  - class_name: Add
    config: {name: Layer_16_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_13_LRELU
        - 0
        - 0
        - &id005 {}
      - - Layer_15_LRELU
        - 0
        - 0
        - *id005
    name: Layer_16_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_17_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_16_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_17_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_17_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_17_CONV
        - 0
        - 0
        - {}
    name: Layer_17_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_17_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_17_Batch
        - 0
        - 0
        - {}
    name: Layer_17_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_18_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_17_LRELU
        - 0
        - 0
        - {}
    name: Layer_18_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: Layer_18_Batch
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_18_CONV
        - 0
        - 0
        - {}
    name: Layer_18_Batch
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_18_LRELU, trainable: true}
    inbound_nodes:
    - - - Layer_18_Batch
        - 0
        - 0
        - {}
    name: Layer_18_LRELU
  - class_name: Add
    config: {name: Layer_19_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_16_Shortcut_Add
        - 0
        - 0
        - &id006 {}
      - - Layer_18_LRELU
        - 0
        - 0
        - *id006
    name: Layer_19_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_20_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_19_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_20_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_1
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_20_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_1
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_20_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_1
        - 0
        - 0
        - {}
    name: Layer_20_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_21_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_20_LRELU
        - 0
        - 0
        - {}
    name: Layer_21_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_2
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_21_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_2
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_21_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_2
        - 0
        - 0
        - {}
    name: Layer_21_LRELU
  - class_name: Add
    config: {name: Layer_22_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_19_Shortcut_Add
        - 0
        - 0
        - &id007 {}
      - - Layer_21_LRELU
        - 0
        - 0
        - *id007
    name: Layer_22_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_23_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_22_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_23_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_3
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_23_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_3
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_23_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_3
        - 0
        - 0
        - {}
    name: Layer_23_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_24_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_23_LRELU
        - 0
        - 0
        - {}
    name: Layer_24_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_4
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_24_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_4
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_24_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_4
        - 0
        - 0
        - {}
    name: Layer_24_LRELU
  - class_name: Add
    config: {name: Layer_25_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_22_Shortcut_Add
        - 0
        - 0
        - &id008 {}
      - - Layer_24_LRELU
        - 0
        - 0
        - *id008
    name: Layer_25_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_26_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_25_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_26_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_5
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_26_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_5
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_26_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_5
        - 0
        - 0
        - {}
    name: Layer_26_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_27_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_26_LRELU
        - 0
        - 0
        - {}
    name: Layer_27_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_6
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_27_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_6
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_27_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_6
        - 0
        - 0
        - {}
    name: Layer_27_LRELU
  - class_name: Add
    config: {name: Layer_28_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_25_Shortcut_Add
        - 0
        - 0
        - &id009 {}
      - - Layer_27_LRELU
        - 0
        - 0
        - *id009
    name: Layer_28_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_29_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_28_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_29_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_7
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_29_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_7
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_29_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_7
        - 0
        - 0
        - {}
    name: Layer_29_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_30_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_29_LRELU
        - 0
        - 0
        - {}
    name: Layer_30_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_8
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_30_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_8
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_30_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_8
        - 0
        - 0
        - {}
    name: Layer_30_LRELU
  - class_name: Add
    config: {name: Layer_31_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_28_Shortcut_Add
        - 0
        - 0
        - &id010 {}
      - - Layer_30_LRELU
        - 0
        - 0
        - *id010
    name: Layer_31_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_32_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_31_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_32_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_9
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_32_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_9
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_32_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_9
        - 0
        - 0
        - {}
    name: Layer_32_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_33_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_32_LRELU
        - 0
        - 0
        - {}
    name: Layer_33_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_10
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_33_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_10
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_33_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_10
        - 0
        - 0
        - {}
    name: Layer_33_LRELU
  - class_name: Add
    config: {name: Layer_34_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_31_Shortcut_Add
        - 0
        - 0
        - &id011 {}
      - - Layer_33_LRELU
        - 0
        - 0
        - *id011
    name: Layer_34_Shortcut_Add
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [1, 1]
      name: Layer_35_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_34_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_35_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_11
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_35_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_11
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_35_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_11
        - 0
        - 0
        - {}
    name: Layer_35_LRELU
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_36_CONV
      padding: same
      strides: !!python/tuple [1, 1]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_35_LRELU
        - 0
        - 0
        - {}
    name: Layer_36_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
      momentum: 0.99
      moving_mean_initializer:
        class_name: Zeros
        config: {}
      moving_variance_initializer:
        class_name: Ones
        config: {}
      name: batch_normalization_12
      scale: true
      trainable: true
    inbound_nodes:
    - - - Layer_36_CONV
        - 0
        - 0
        - {}
    name: batch_normalization_12
  - class_name: LeakyReLU
    config: {alpha: 0.10000000149011612, name: Layer_36_LRELU, trainable: true}
    inbound_nodes:
    - - - batch_normalization_12
        - 0
        - 0
        - {}
    name: Layer_36_LRELU
  - class_name: Add
    config: {name: Layer_37_Shortcut_Add, trainable: true}
    inbound_nodes:
    - - - Layer_34_Shortcut_Add
        - 0
        - 0
        - &id012 {}
      - - Layer_36_LRELU
        - 0
        - 0
        - *id012
    name: Layer_37_Shortcut_Add
  - class_name: ZeroPadding2D
    config:
      data_format: channels_last
      name: Layer_38_Zero_Padding
      padding: !!python/tuple
      - !!python/tuple [1, 0]
      - !!python/tuple [1, 0]
      trainable: true
    inbound_nodes:
    - - - Layer_37_Shortcut_Add
        - 0
        - 0
        - {}
    name: Layer_38_Zero_Padding
  - class_name: Conv2D
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 512
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: Layer_38_CONV
      padding: valid
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: false
    inbound_nodes:
    - - - Layer_38_Zero_Padding
        - 0
        - 0
        - {}
    name: Layer_38_CONV
  - class_name: BatchNormalization
    config:
      axis: -1
      beta_constraint: null
      beta_initializer:
        class_name: Zeros
        config: {}
      beta_regularizer: null
      center: true
      epsilon: 0.001
      gamma_constraint: null
      gamma_initializer:
        class_name: Ones
        config: {}
      gamma_regularizer: null
